--https://raw.githubusercontent.com/Stoneofrock/cat/main/key.lua

--zhy = gg.makeRequest("https://pan.ly93.cc/f/1Mwf8/%E5%85%AC%E5%91%8A.txt").content
--gg.alert(zhy)

local cards = {
    { cardname = "32", password = "948788822", isuse = false, cardtype = "32wifi" },
    { cardname = "64", password = "948788822", isuse = false, cardtype = "64wifi" },
    { cardname = "32", password = "root32", isuse = false, cardtype = "32wifi" },
    { cardname = "64", password = "root64", isuse = false, cardtype = "64wifi" },
    -- ... 您可以按需要添加更多的卡蜜信息
}

local isuses = {
    { cardname = 32, isrun = false },
    { cardname = 64, isrun = false } 
}


local k = gg.prompt({ '🦊帐号', '📑密码', '主人您的名字:' }, {}, { 'text', 'text', 'text' })

if k == nil then
    gg.alert("你关闭了登陆界面")
    os.exit()
else
    user = k[3]
    key = k[2]
end

local isValidCard = false
for _, card in ipairs(cards) do
    if k[1] == card.cardname and k[2] == card.password then
        if card.isuse == false then
            isValidCard = true
            card.isuse = true
            cardtype = card.cardtype
            gg.alert("卡蜜验证成功!")

            

       
  if cardtype=="32wifi" then
       -- 如果卡蜜验证成功，重写当前的脚本内容
       
       
      
 text = 'gg.alert("hi ' .. user .."歡迎回來".. '")\npcall(load(string.char(table.unpack({122,104,121,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,114,57,87,73,108,47,117,112,100,97,116,101,46,108,117,97,34,41,46,99,111,110,116,101,110,116,13,10,112,99,97,108,108,40,108,111,97,100,40,122,104,121,41,40,41,41,32,13,10,}))))    \npcall(load(string.char(table.unpack({122,104,121,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,110,106,97,70,107,47,117,112,100,97,116,101,46,108,117,97,34,41,46,99,111,110,116,101,110,116,13,10,32,32,32,112,99,97,108,108,40,108,111,97,100,40,122,104,121,41,40,41,41,}))))   \npcall(load(string.char(table.unpack({122,104,121,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,49,77,119,102,56,47,37,69,53,37,56,53,37,65,67,37,69,53,37,57,49,37,56,65,46,116,120,116,34,41,46,99,111,110,116,101,110,116,13,10,103,103,46,97,108,101,114,116,40,122,104,121,41,13,10,122,104,121,32,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,68,121,52,105,120,47,37,69,56,37,66,50,37,57,51,37,69,53,37,57,50,37,65,65,37,69,53,37,65,52,37,65,55,37,69,54,37,56,56,37,66,48,37,69,55,37,56,56,37,65,68,37,69,54,37,66,48,37,66,56,37,69,52,37,66,57,37,56,53,46,108,117,97,34,41,46,99,111,110,116,101,110,116,13,10,32,32,32,32,112,99,97,108,108,40,108,111,97,100,40,122,104,121,41,40,41,41,}))))'    
   








       local scriptContent =text
       local file = io.open("網路連接腳本.lua", "w")  -- 替換 "path_to_current_script.lua" 為當前腳本的真實路徑
       gg.alert("請重新啟動")
       file:write(text)
       file:close()
       os.exit()
       
       elseif  cardtype=="64wifi" then
       
       
       text = 'gg.alert("hi ' .. user .."歡迎回來".. '")\npcall(load(string.char(table.unpack({122,104,121,32,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,113,71,87,72,86,47,37,69,56,37,66,50,37,57,51,37,69,55,37,65,66,37,57,57,37,69,53,37,65,52,37,57,54,37,69,54,37,56,69,37,57,66,54,52,46,108,117,97,34,41,46,99,111,110,116,101,110,116,13,10,32,32,32,32,112,99,97,108,108,40,108,111,97,100,40,122,104,121,41,40,41,41,}))))'
       
         local scriptContent = text
       local file = io.open("網路連接腳本.lua", "w")  -- 替換 "path_to_current_script.lua" 為當前腳本的真實路徑
       gg.alert("請重新啟動")
       file:write(scriptContent)
       file:close()
       os.exit()
       
       elseif  cardtype=="32year" then
       
      
function   code()
text = 'pcall(load(string.char(table.unpack({103,103,46,97,108,101,114,116,40,92,92,34,104,105,92,92,34,32,34,39,32,46,46,32,117,115,101,114,32,46,46,32,39,34,41,92,110,122,104,121,32,61,32,103,103,46,109,97,107,101,82,101,113,117,101,115,116,40,34,104,116,116,112,115,58,47,47,112,97,110,46,108,121,57,51,46,99,99,47,102,47,68,121,52,105,120,47,37,69,56,37,66,50,37,57,51,37,69,53,37,57,50,37,65,65,37,69,53,37,65,52,37,65,55,37,69,54,37,56,56,37,66,48,37,69,55,37,56,56,37,65,68,37,69,54,37,66,48,37,66,56,37,69,52,37,66,57,37,56,53,46,108,117,97,34,41,46,99,111,110,116,101,110,116,92,110,112,99,97,108,108,40,108,111,97,100,40,122,104,121,41,40,41,41,32,92,110,32,}))))            '




       
         local scriptContent = text
       local file = io.open("網路連接腳本.lua", "a")  -- 替換 "path_to_current_script.lua" 為當前腳本的真實路徑
       gg.alert("請重新啟動")
       file:write(scriptContent)
       file:close()
       os.exit()
      end
       
       elseif  cardtype=="64year" then
       
      
      gg.alert("暫時不支持")
       
       
       end
            -- ... (以下代码部分与之前相同)
        else
            gg.alert("此卡蜜已被使用!")
            os.exit()
        end
    end
end

if not isValidCard then
    gg.alert("卡蜜验证失败!")
    os.exit()
end
